# IsNameUnique Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
Material..::..IsNameUnique Method
Material Class See Also
---
Validates whether the material name is unique in document.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public static bool IsNameUnique(
	Document aDocument,
	string name
)
```

Visual Basic
---
```text
Public Shared Function IsNameUnique ( _
	aDocument As Document, _
	name As String _
) As Boolean
```

Visual C++
---
```text
public:
static bool IsNameUnique(
	Document^ aDocument,
	String^ name
)
```

# ### Parameters
aDocument
    Type: Autodesk.Revit.DB..::..Document The document in which the name is being tested for uniqueness.
name
    Type: System..::..String The name tested for uniqueness.
# ### Return Value
Returns true if the name is unique, and false otherwise.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
Material Class
Autodesk.Revit.DB Namespace